Analyzing DataFrames in pandas involves exploring, summarizing, and deriving insights from tabular data using a variety of built-in methods and functions. Since you’ve previously asked about Pandas Series, DataFrames, and reading data from various formats, I’ll focus on practical techniques for analyzing DataFrames, including descriptive statistics, grouping, filtering, handling missing data, and visualization preparation. I’ll provide concise explanations and code examples to demonstrate each method, assuming you’re working with a DataFrame loaded from a source like a CSV, JSON, or SQL database.

### Key Aspects of DataFrame Analysis
Analyzing a DataFrame typically involves:

- **Inspecting the Data**: Understanding the structure and content.
- **Descriptive Statistics**: Summarizing numerical and categorical data.
- **Filtering and Subsetting**: Extracting specific rows or columns.
- **Grouping and Aggregation**: Summarizing data by groups.
- **Handling Missing Data**: Identifying and addressing gaps.
- **Correlation and Relationships**: Exploring relationships between variables.
- **Sorting and Ranking**: Ordering data for insights.
- **Visualization Preparation**: Preparing data for plotting (though I’ll avoid generating plots unless requested, as per guidelines).

In [7]:
import pandas as pd
df = pd.read_csv('AnalysisData.csv')
df

     name  age  salary   department
0   Karen   53   48402        Sales
1   Karen   36   50229           HR
2     Tom   57   75397    Marketing
3     Bob   32  118127    Marketing
4    John   59   96237           IT
..    ...  ...     ...          ...
95  Karen   59   55519           IT
96    Bob   26   74830    Marketing
97   John   59   40323           IT
98  Diana   42   53692  Engineering
99  Linda   30   62561           IT

[100 rows x 4 columns]

#### 1. Inspecting the DataFrame
Understand the structure and content of the DataFrame.

- **View Basic Info**:

In [9]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        100 non-null    object
 1   age         100 non-null    int64
 2   salary      100 non-null    int64
 3   department  100 non-null    object
dtypes: int64(2), object(2)
memory usage: 3.3+ KB
None

 - Shows column names, non-null counts, and data types.

- **View First/Last Rows**:

In [13]:
print(df.head(2))  # First 2 rows
print(df.tail(2))  # Last 2 rowszc

    name  age  salary department
0  Karen   53   48402      Sales
1  Karen   36   50229         HR
     name  age  salary   department
98  Diana   42   53692  Engineering
99  Linda   30   62561           IT

- **Shape and Columns**:

In [23]:
print(df.shape)

(100, 4)

In [21]:
print(df.columns)

Index(['name', 'age', 'salary', 'department'], dtype='object')

- **Unique Values**:

In [27]:
print(df['department'].unique())

['Sales' 'HR' 'Marketing' 'IT' 'Engineering' 'Finance']

In [25]:
print(df['department'].nunique())

6

#### 2. Descriptive Statistics
Summarize numerical and categorical data to understand distributions and patterns.

- **Numerical Columns**:

In [30]:
print(df.describe())

              age         salary
count  100.000000     100.000000
mean    40.920000   67790.640000
std     10.837347   24876.058269
min     22.000000   31589.000000
25%     31.000000   46153.000000
50%     39.500000   69090.000000
75%     51.250000   86647.250000
max     60.000000  119509.000000

 - Provides count, mean, std, min, max, and quartiles for numeric columns.

- **Categorical Columns**:

In [34]:
print(df['department'].value_counts())

department
Marketing      20
Engineering    20
IT             17
HR             16
Finance        15
Sales          12
Name: count, dtype: int64

 - Shows frequency of each category.

- **Custom Statistics**:

In [44]:
print(df['salary'].mean())

67790.64

In [46]:
print(df['age'].median())

39.5

#### 3. Filtering and Subsetting
Extract specific rows or columns based on conditions.

- **Select Columns**:

In [50]:
print(df[['name', 'salary']])

     name  salary
0   Karen   48402
1   Karen   50229
2     Tom   75397
3     Bob  118127
4    John   96237
..    ...     ...
95  Karen   55519
96    Bob   74830
97   John   40323
98  Diana   53692
99  Linda   62561

[100 rows x 2 columns]

- **Filter Rows by Condition**:

In [53]:
print(df[df['salary'] > 55000])

     name  age  salary department
2     Tom   57   75397  Marketing
3     Bob   32  118127  Marketing
4    John   59   96237         IT
5   Diana   59  101200         IT
6    Mike   51   62179  Marketing
..    ...  ...     ...        ...
93  Steve   35   55171  Marketing
94   Mike   39   71429         HR
95  Karen   59   55519         IT
96    Bob   26   74830  Marketing
99  Linda   30   62561         IT

[64 rows x 4 columns]

- **Multiple Conditions**:

In [56]:
print(df[(df['department'] == 'IT') & (df['age'] > 25)])

     name  age  salary department
4    John   59   96237         IT
5   Diana   59  101200         IT
12   Emma   45  111789         IT
20   Mike   43   39542         IT
23   John   42   72180         IT
25  Diana   49   32967         IT
28   Mike   33   86693         IT
46  Steve   51   82336         IT
48  Alice   30   90907         IT
50  Steve   46   37164         IT
52   John   27   44600         IT
62  Linda   59   86632         IT
64  Karen   34   45421         IT
81  Diana   38   93472         IT
95  Karen   59   55519         IT
97   John   59   40323         IT
99  Linda   30   62561         IT

- **Query Method**:

In [59]:
print(df.query('salary > 55000 and department == "IT"'))

     name  age  salary department
4    John   59   96237         IT
5   Diana   59  101200         IT
12   Emma   45  111789         IT
23   John   42   72180         IT
28   Mike   33   86693         IT
46  Steve   51   82336         IT
48  Alice   30   90907         IT
62  Linda   59   86632         IT
81  Diana   38   93472         IT
95  Karen   59   55519         IT
99  Linda   30   62561         IT

#### 4. Grouping and Aggregation
Group data by one or more columns and compute aggregate statistics.

- **Single GroupBy**:

In [62]:
print(df.groupby('department')['salary'].mean())

department
Engineering    61241.000000
Finance        73004.200000
HR             60773.375000
IT             69384.882353
Marketing      71595.350000
Sales          72946.416667
Name: salary, dtype: float64

- **Multiple Aggregations**:

In [65]:
print(df.groupby('department').agg({'salary': ['mean', 'count'], 'age': 'max'}))

                   salary       age
                     mean count max
department
Engineering  61241.000000    20  60
Finance      73004.200000    15  57
HR           60773.375000    16  59
IT           69384.882353    17  59
Marketing    71595.350000    20  57
Sales        72946.416667    12  53

- **GroupBy with Custom Function**:

In [68]:
print(df.groupby('department')['salary'].apply(lambda x: x.max() - x.min()))

department
Engineering    85168
Finance        86253
HR             72944
IT             78822
Marketing      86538
Sales          71835
Name: salary, dtype: int64

#### 5. Handling Missing Data
Identify and address missing values (NaN or None).

- **Detect Missing Data**:

In [71]:
print(df.isna())

     name    age  salary  department
0   False  False   False       False
1   False  False   False       False
2   False  False   False       False
3   False  False   False       False
4   False  False   False       False
..    ...    ...     ...         ...
95  False  False   False       False
96  False  False   False       False
97  False  False   False       False
98  False  False   False       False
99  False  False   False       False

[100 rows x 4 columns]

In [73]:
print(df.isna().sum())

name          0
age           0
salary        0
department    0
dtype: int64

- **Fill Missing Data**:

In [76]:
df_filled = df.fillna({'name': 'Unknown', 'age': df['age'].mean(), 'salary': df['salary'].median()})
print(df_filled)

     name  age  salary   department
0   Karen   53   48402        Sales
1   Karen   36   50229           HR
2     Tom   57   75397    Marketing
3     Bob   32  118127    Marketing
4    John   59   96237           IT
..    ...  ...     ...          ...
95  Karen   59   55519           IT
96    Bob   26   74830    Marketing
97   John   59   40323           IT
98  Diana   42   53692  Engineering
99  Linda   30   62561           IT

[100 rows x 4 columns]

- **Drop Missing Data**:

In [79]:
print(df.dropna())

     name  age  salary   department
0   Karen   53   48402        Sales
1   Karen   36   50229           HR
2     Tom   57   75397    Marketing
3     Bob   32  118127    Marketing
4    John   59   96237           IT
..    ...  ...     ...          ...
95  Karen   59   55519           IT
96    Bob   26   74830    Marketing
97   John   59   40323           IT
98  Diana   42   53692  Engineering
99  Linda   30   62561           IT

[100 rows x 4 columns]

#### 6. Correlation and Relationships
Explore relationships between numerical columns.

- **Correlation Matrix**:

In [82]:
print(df.corr(numeric_only=True))

             age    salary
age     1.000000  0.101319
salary  0.101319  1.000000

  - Uses Pearson correlation by default; use <span style="color:orange">method='spearman'</span> or <span style="color:orange">'kendall'</span> for alternatives.

- **Covariance**:

In [88]:
print(df.cov(numeric_only=True))

                 age        salary
age       117.448081  2.731461e+04
salary  27314.607273  6.188183e+08

#### 7. Sorting and Ranking
Order data to identify top/bottom values or trends.

- **Sort by Column**:

In [91]:
print(df.sort_values('salary', ascending=False))

     name  age  salary   department
85    Bob   40  119509      Finance
3     Bob   32  118127    Marketing
88    Tom   27  117612  Engineering
63   Mike   52  115378  Engineering
90  Alice   32  113510      Finance
..    ...  ...     ...          ...
25  Diana   49   32967           IT
76  Linda   26   32444  Engineering
58   John   26   32314           HR
56    Bob   36   31749           HR
83    Tom   48   31589    Marketing

[100 rows x 4 columns]

- **Sort by Multiple Columns**:

In [94]:
print(df.sort_values(['department', 'age']))

     name  age  salary   department
13   Mike   26   48215  Engineering
76  Linda   26   32444  Engineering
88    Tom   27  117612  Engineering
37   Mike   31   61859  Engineering
71  Steve   32   52259  Engineering
..    ...  ...     ...          ...
30  Alice   37   59746        Sales
55  Diana   42   97053        Sales
17  Steve   48   86819        Sales
72  Karen   52   85213        Sales
0   Karen   53   48402        Sales

[100 rows x 4 columns]

- **Rank Values**:

In [97]:
print(df['salary'].rank())

0     29.0
1     31.0
2     63.0
3     99.0
4     86.0
      ...
95    38.0
96    61.0
97    21.0
98    35.0
99    47.0
Name: salary, Length: 100, dtype: float64

#### 8. Visualization Preparation
While I won’t generate plots (per guidelines), I’ll show how to prepare data for visualization (e.g., with Matplotlib or Seaborn).

- **Group for Bar Plot**:

In [100]:
dept_salary = df.groupby('department')['salary'].mean()
print(dept_salary)  # Ready for plotting

department
Engineering    61241.000000
Finance        73004.200000
HR             60773.375000
IT             69384.882353
Marketing      71595.350000
Sales          72946.416667
Name: salary, dtype: float64

- **Pivot Table for Heatmap**:

In [103]:
pivot = df.pivot_table(values='salary', index='department', columns='age', aggfunc='mean')
print(pivot)

age               22       23       25       26        27       28       29  \
department
Engineering      NaN      NaN      NaN  40329.5  117612.0      NaN      NaN
Finance          NaN      NaN  33536.0  35259.0       NaN      NaN      NaN
HR               NaN      NaN      NaN  40141.0       NaN  74087.5      NaN
IT               NaN      NaN      NaN      NaN   44600.0      NaN      NaN
Marketing    61060.0  78362.0      NaN  74830.0       NaN      NaN  96717.0
Sales            NaN      NaN      NaN      NaN       NaN  69993.5  79496.0

age               30       31        32  ...       48       49       51  \
department                               ...
Engineering      NaN  61859.0   52259.0  ...      NaN  39224.0      NaN
Finance          NaN  52914.0  113510.0  ...      NaN      NaN      NaN
HR               NaN  70836.0   66436.0  ...      NaN      NaN      NaN
IT           76734.0      NaN       NaN  ...      NaN  32967.0  82336.0
Marketing        NaN  92084.0  118127.0  ...  60449.0      NaN  62179.0
Sales            NaN  78932.0       NaN  ...  86819.0      NaN      NaN

age                52       53       54       56            57       59  \
department
Engineering  115378.0  63724.0  57246.0      NaN  59098.000000      NaN
Finance           NaN  94040.0      NaN      NaN  91040.000000      NaN
HR            84645.0  70779.0      NaN      NaN           NaN  79061.0
IT                NaN      NaN      NaN      NaN           NaN  75982.2
Marketing         NaN  83431.0  50054.0  42414.0  82807.333333      NaN
Sales         85213.0  48402.0      NaN      NaN           NaN      NaN

age               60
department
Engineering  77456.0
Finance          NaN
HR               NaN
IT               NaN
Marketing        NaN
Sales            NaN

[6 rows x 35 columns]

### Performance Considerations
- **Memory**: Use <span style="color:orange">dtype</span> optimization (e.g., <span style="color:orange">float32</span> instead of <span style="color:orange">float64</span>) for large datasets.
- **Speed**: Prefer vectorized operations (e.g., <span style="color:orange">df['salary'] > 60000</span>) over loops.
- **Large Datasets**: Use <span style="color:orange">groupby</span> with <span style="color:orange">agg</span> for efficient aggregation; consider <span style="color:orange">dask</span> for big data.